Revit 2027 API
LocationPoint.Rotation Property
The angle of rotation around the insertion point, in radians.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Rotation { get; }
Public ReadOnly Property Rotation As Double
	Get
public:
property double Rotation {
	double get ();
}
member Rotation : float with get
Property Value
Double
Remarks
For view-based elements, the rotation angle is in the plane of the associated view. For model elements, the rotation angle is measured relative to the default coordinate system. This property is not supported for some elements supporting LocationPoints, such as AssemblyInstances, Groups, ModelText, Room, and SpotDimensions.
See Also
Reference
LocationPoint Class
Autodesk.Revit.DB Namespace